## Dictionary

In [3]:
world = { "afghanistan":30.55, "albania":2.77, "algeria":39.21 }

In [4]:
world["albania"]

2.77

- dict_name[ key ]
- result: value

In [1]:
world = {"afghanistan":30.55, "albania":2.77, # Ketika ada dua nama key apa yang terjadi?
"algeria":39.21, "albania":2.81}

In [2]:
world

{'afghanistan': 30.55, 'albania': 2.81, 'algeria': 39.21}

In [3]:
{0:"hello", True:"dear", "two":"world"}

{0: 'hello', True: 'dear', 'two': 'world'}

In [4]:
{["just", "to", "test"]: "value"}

TypeError: unhashable type: 'list'

In [5]:
world

{'afghanistan': 30.55, 'albania': 2.81, 'algeria': 39.21}

In [6]:
world["sealand"] = 0.000027

In [7]:
world

{'afghanistan': 30.55, 'albania': 2.81, 'algeria': 39.21, 'sealand': 2.7e-05}

In [8]:
"sealand" in world

True

In [9]:
world["sealand"] = 0.000028

In [10]:
world

{'afghanistan': 30.55, 'albania': 2.81, 'algeria': 39.21, 'sealand': 2.8e-05}

In [11]:
del(world["sealand"])

In [12]:
world

{'afghanistan': 30.55, 'albania': 2.81, 'algeria': 39.21}

- List
- Select, update remove : []
- Index dengan angka
- Koleksi nilai dengan urutan 

- Dictionary
- Select, update, remove: []
- Index dengan key yang unik
- Menggunakan tabel lookup dari key yang unika

## Dataset di Python

- 2 Numpy Array? Hanya satu tipe data

- Yayy ada pandas
- Sebuah tool untuk manupulasi data
- Dibuat oleh Wes Mckinney
- Dibuat berdasrkan Numpy
- Berbentuk DataFrame

In [14]:
negara = {
"country":["Brazil", "Russia", "India", "China", "South Africa"],
"capital":["Brasilia", "Moscow", "New Delhi", "Beijing", "Pretoria"],
"area":[8.516, 17.10, 3.286, 9.597, 1.221],
"population":[200.4, 143.5, 1252, 1357, 52.98] }

In [15]:
import pandas as pd

In [16]:
negara_df = pd.DataFrame(negara)

In [17]:
negara_df

     area    capital       country  population
0   8.516   Brasilia        Brazil      200.40
1  17.100     Moscow        Russia      143.50
2   3.286  New Delhi         India     1252.00
3   9.597    Beijing         China     1357.00
4   1.221   Pretoria  South Africa       52.98

- Observation
- Variabel
- Column Label
- Row Label

In [18]:
negara_df.index = ["BR", "RU", "IN", "CH", "SA"]

In [19]:
negara_df

      area    capital       country  population
BR   8.516   Brasilia        Brazil      200.40
RU  17.100     Moscow        Russia      143.50
IN   3.286  New Delhi         India     1252.00
CH   9.597    Beijing         China     1357.00
SA   1.221   Pretoria  South Africa       52.98

## DataFrame dari CSV

In [20]:
df = pd.read_csv('negara.csv')

In [21]:
df

  Unnamed: 0       country    capital    area  population
0         BR        Brazil   Brasilia   8.516      200.40
1         RU        Russia     Moscow  17.100      143.50
2         IN         India  New Delhi   3.286     1252.00
3         CH         China    Beijing   9.597     1357.00
4         SA  South Africa   Pretoria   1.221       52.98

In [22]:
df = pd.read_csv('negara.csv', index_col=0)

In [23]:
df

         country    capital    area  population
BR        Brazil   Brasilia   8.516      200.40
RU        Russia     Moscow  17.100      143.50
IN         India  New Delhi   3.286     1252.00
CH         China    Beijing   9.597     1357.00
SA  South Africa   Pretoria   1.221       52.98

In [24]:
import pandas as pd
df = pd.read_csv('negara.csv', index_col=0)
df

         country    capital    area  population
BR        Brazil   Brasilia   8.516      200.40
RU        Russia     Moscow  17.100      143.50
IN         India  New Delhi   3.286     1252.00
CH         China    Beijing   9.597     1357.00
SA  South Africa   Pretoria   1.221       52.98

## Index and Select Data

- []
- loc dan iloc

In [25]:
df['country']

BR          Brazil
RU          Russia
IN           India
CH           China
SA    South Africa
Name: country, dtype: object

In [26]:
type(df['country'])

pandas.core.series.Series

In [27]:
df[['country']]

         country
BR        Brazil
RU        Russia
IN         India
CH         China
SA  South Africa

In [28]:
type(df[['country']])

pandas.core.frame.DataFrame

In [29]:
df[['country', 'capital']]

         country    capital
BR        Brazil   Brasilia
RU        Russia     Moscow
IN         India  New Delhi
CH         China    Beijing
SA  South Africa   Pretoria

In [30]:
type(df[['country', 'capital']])

pandas.core.frame.DataFrame

In [31]:
df[1:4]

   country    capital    area  population
RU  Russia     Moscow  17.100       143.5
IN   India  New Delhi   3.286      1252.0
CH   China    Beijing   9.597      1357.0

## Menggunakan loc

In [32]:
df.loc['RU']

country       Russia
capital       Moscow
area            17.1
population     143.5
Name: RU, dtype: object

In [33]:
df.loc[['RU']]

   country capital  area  population
RU  Russia  Moscow  17.1       143.5

In [34]:
df.loc[["RU", "IN", "CH"]]

   country    capital    area  population
RU  Russia     Moscow  17.100       143.5
IN   India  New Delhi   3.286      1252.0
CH   China    Beijing   9.597      1357.0

In [35]:
df.loc[["RU", "IN", "CH"], ["country", "capital"]]

   country    capital
RU  Russia     Moscow
IN   India  New Delhi
CH   China    Beijing

In [36]:
df.loc[:, ["country", "capital"]]

         country    capital
BR        Brazil   Brasilia
RU        Russia     Moscow
IN         India  New Delhi
CH         China    Beijing
SA  South Africa   Pretoria

## Menggunakan iloc

In [40]:
df

         country    capital    area  population
BR        Brazil   Brasilia   8.516      200.40
RU        Russia     Moscow  17.100      143.50
IN         India  New Delhi   3.286     1252.00
CH         China    Beijing   9.597     1357.00
SA  South Africa   Pretoria   1.221       52.98

In [38]:
df.loc['RU']

country       Russia
capital       Moscow
area            17.1
population     143.5
Name: RU, dtype: object

In [39]:
df.iloc[1]

country       Russia
capital       Moscow
area            17.1
population     143.5
Name: RU, dtype: object

In [41]:
df.loc[["RU", "IN", "CH"]]

   country    capital    area  population
RU  Russia     Moscow  17.100       143.5
IN   India  New Delhi   3.286      1252.0
CH   China    Beijing   9.597      1357.0

In [42]:
df.iloc[[1,2,3]]

   country    capital    area  population
RU  Russia     Moscow  17.100       143.5
IN   India  New Delhi   3.286      1252.0
CH   China    Beijing   9.597      1357.0

In [43]:
df.loc[["RU", "IN", "CH"], ["country", "capital"]]

   country    capital
RU  Russia     Moscow
IN   India  New Delhi
CH   China    Beijing

In [44]:
df.iloc[[1,2,3], [0, 1]]

   country    capital
RU  Russia     Moscow
IN   India  New Delhi
CH   China    Beijing

In [45]:
df.loc[:, ["country", "capital"]]

         country    capital
BR        Brazil   Brasilia
RU        Russia     Moscow
IN         India  New Delhi
CH         China    Beijing
SA  South Africa   Pretoria

In [46]:
df.iloc[:, [0, 1]]

         country    capital
BR        Brazil   Brasilia
RU        Russia     Moscow
IN         India  New Delhi
CH         China    Beijing
SA  South Africa   Pretoria